# Removing Outlier Using IQR

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
data=pd.read_csv('heights_IQR.csv')
data

       name  height
0     mohan     1.2
1     maria     2.3
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1
17    aamir    14.5
18      ken    23.2
19      Liu    40.2

In [3]:
data.describe()

          height
count  20.000000
mean    8.390000
std     8.782812
min     1.200000
25%     5.350000
50%     5.700000
75%     6.275000
max    40.200000

In [6]:
IQR=data['height'].quantile(0.75)-data['height'].quantile(0.25)
IQR

0.9249999999999998

In [8]:
lower=data.height.quantile(0.25)-1.5*IQR
lower

3.962500000000001

In [10]:
upper=data.height.quantile(0.75)+1.5*IQR
upper

7.6625

In [11]:
data[(data['height']>lower) & (data['height']<upper)]

       name  height
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1

In [12]:
data[(data['height']<lower) | (data['height']>upper)]

     name  height
0   mohan     1.2
1   maria     2.3
17  aamir    14.5
18    ken    23.2
19    Liu    40.2

## Exercise

In [13]:
data=pd.read_csv('height_weight.csv')
data

      gender     height      weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

### Outliers Based On Height

In [116]:
Q1=data.height.quantile(0.25)
Q3=data.height.quantile(0.75)
IQR_height=Q3-Q1
IQR_height

5.668641245615746

In [117]:
lower_h=Q1-1.5*IQR_height
upper_h=Q3+1.5*IQR_height
lower_h,upper_h

(55.00265861279534, 77.67722359525831)

### Outliers Based On Weight

In [119]:
Q1=data.weight.quantile(0.25)
Q3=data.weight.quantile(0.75)
IQR_weight=Q3-Q1
IQR_weight

51.35147356318197

In [120]:
lower_w=Q1-1.5*IQR_weight
upper_w=Q3+1.5*IQR_weight
lower_w,upper_w

(58.79084096072856, 264.19673521345646)

In [121]:
data[(data['height']<lower_h) | (data['height']>upper_h)]

      gender     height      weight
994     Male  78.095867  255.690835
1317    Male  78.462053  227.342565
2014    Male  78.998742  269.989699
3285    Male  78.528210  253.889004
3757    Male  78.621374  245.733783
6624  Female  54.616858   71.393749
7294  Female  54.873728   78.606670
9285  Female  54.263133   64.700127

In [122]:
data[(data['weight']<lower_w) | (data['weight']>upper_w)]

     gender     height      weight
2014   Male  78.998742  269.989699

In [125]:
final_data=data[(data['weight']>lower_w) & (data['weight']<upper_w) & (data['height']>lower_h) & (data['height']<upper_h)]
final_data  #final data after removing outliers

      gender     height      weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[9992 rows x 3 columns]